engineers_names = {
    "roohi": "محمدرضا روحی",
    "heydari": "حسن حیدری",
    "jamali": "حسین جمالی",
    "seydi": "حسن صیدی",
    "hassan_nejad": "لعیا حسن نژاد",
    "sheykh": "حسینعلی شیخ",
    "shahriar":"شهریار ابرام پور"
}

task_name = {
    0: "طراحی ابزار",
    1: "طراحی فیکسچر",
    2: "طراحی محصول",
    3: "طراحی قالب",
    4: "یدکی اصلاحی",
    5: "طراحی دستگاه",
    6: "تهیه اسناد  Drawing",
    7: "تهیه اسناد  BOM",
    8: "تهیه اسناد گزارش",
    9: "کارشناسی طراحی و ساخت",
    10: "آرشیو اسناد",
    11: "ممیزی اسناد و مدارک",
    12: "طراحی ماشین",
    13: "مدارک محصولات",
    14: "جلسات",
    15: "مطالعه و تحقیق",
    16: "تهیه فایل برشکاری DWG",
    17: "چک کردن نقشه و فایل",
    18: "OP",
    19: "زمان سنجی",
    20: "برون سپاری",
    21: "تنظیمات پرینتر سه بعدی",
    22: "محاسبه هزینه",
    23: "ثبت عدم انطباق",  # Hassan_nejad
    24: "پیگیری امور جاری",  # Hassan_nejad
    25: "رسیدگی به نامه های اتوماسیون",  # Hassan_nejad
    26: "اتوماسیون",  # Roohi
    27: "مصاحبه فنی",  # Roohi
    28: "تحویل فایل و نقشه",  # Hassan_nejad
    29: "آموزش",
}

#Roohi  00000001
#Jamali 1111111
#Sheykh 2222222
#HN     3333333