engineers_names = {
    "roohi": "محمدرضا روحی",
    "heydari": "حسن حیدری",
    "jamali": "حسین جمالی",
    "seydi": "حسن صیدی",
    "hassan_nejad": "لعیا حسن نژاد",
    "sheykh": "حسینعلی شیخ"}

task_name = {
    0: "طراحی ابزار",
    1: "طراحی فیکسچر",
    2: "طراحی محصول",
    3: "طراحی قالب",
    4: "طراحی یدکی اصلاحی",
    5: "طراحی دستگاه",
    6: "تهیه اسناد  Drawing",
    7: "تهیه اسناد  BOM",
    8: "تهیه اسناد گزارش",
    9: "کارشناسی طراحی و ساخت",
    10: "آرشیو اسناد",
    11: "آموزش",
    12: "ممیزی اسناد و مدارک",
    13: "طراحی ماشین",
    14: "مدارک محصولات",
    15: "جلسات",
    16: "کلاس",
    17: "مطالعه و تحقیق",
    18: "تهیه فایل برشکاری DWG",
    19: "چک کردن نقشه و فایل",
    20: "OP",
    21: "زمان سنجی",
    22: "برون سپاری",
    23: "تنظیمات پرینتر سه بعدی",  # Jamali
    24: "ثبت عدم انطباق",  # Hassan_nejad
    25: "محاسبه هزینه",  # Sheykh
    26: "پیگیری امور جاری",  # Hassan_nejad
    27: "رسیدگی به نامه های اتوماسیون",  # Hassan_nejad
    28: "اتوماسیون",  # Roohi
    29: "مصاحبه فنی",  # Roohi
    30: "تحویل فایل و نقشه"  # Hassan_nejad
}

#Roohi  0000000
#Jamali 1111111
#Sheykh 2222222
#HN     3333333