engineers_names = {
    # BT 2
    "roohi": "محمدرضا روحی",
    "heydari": "حسن حیدری",
    "jamali": "حسین جمالی",
    "seydi": "حسن صیدی",
    "hassan_nejad": "لعیا حسن نژاد",
    "sheykh": "حسینعلی شیخ",
    "shahriar": "شهریار ابرام پور",
    "noohi": "سینا نوحی",
    "karami": "مهدی کرمی",
    "amini": "فرشته امینی نسب",
    "safarbali": "بابک صفربالی",

    # BT 1
    "mohammad_aali": "محمد عالی",
    "amir_mohammadi": "امیر محمدی",
    "milad_heydari": "میلاد حیدری",
    "aliAkbari": "جابر علی اکبری",

    # BT 3
    "yaser_alamooti": "یاسر الموتی",
    "mehdi_sadeghi": "مهدی صادقی",
    "azimpour": "میلاد عظیم پور",
}

task_name = {
    0: "طراحی ابزار",
    1: "طراحی فیکسچر",
    2: "طراحی محصول",
    3: "طراحی قالب",
    4: "یدکی اصلاحی",
    5: "طراحی دستگاه",
    6: "تهیه اسناد Drawing",
    7: "تهیه اسناد BOM",
    8: "تهیه اسناد گزارش",
    9: "کارشناسی طراحی و ساخت",
    10: "آرشیو اسناد",
    11: "ممیزی اسناد و مدارک",
    12: "طراحی ماشین",
    13: "مدارک محصولات",
    14: "جلسات",
    15: "مطالعه و تحقیق",
    16: "تهیه فایل برشکاری DWG",
    17: "چک کردن نقشه و فایل",
    18: "OP",
    19: "زمان سنجی",
    20: "برون سپاری",
    21: "شبیه سازی با ماگما",
    22: "آماده سازی فایل برای ماگما",
    23: "مهندسی فرایند",
    24: "مهندسی معکوس",


    25: "تنظیمات پرینتر سه بعدی",
    26: "محاسبه هزینه",
    27: "ثبت عدم انطباق",  # Hassan_nejad
    28: "پیگیری امور جاری",  # Hassan_nejad
    29: "رسیدگی به نامه‌های اتوماسیون",  # Hassan_nejad
    30: "اتوماسیون",  # Roohi
    31: "مصاحبه فنی",  # Roohi
    32: "تحویل فایل و نقشه",  # Hassan_nejad
    33: "آموزش",
    34: "آنالیز حرارتی"
}
